Revit 2027 API
CeramicBumpType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicBump" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CeramicBumpType
Public Enumeration CeramicBumpType
public enum class CeramicBumpType
type CeramicBumpType
Members
Member name | Value | Description
Custom | 2
None | 0
Wavy | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace